<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"c27e76e06dac9760a49bce4fcc584b95ab9c870c8089b66299503f5227075883","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1389 at https://github.com/cal-itp/data-infra/actions/runs/21486121395","plan_out_hash":"247d6d01cab14ac189522af6e2cf58a24d9e0565c18a4c2fa812faad21dc95d5","plan_hash":"6f0c16981a1bdef04534741b5fc4243eb9bd4f8b69e73469f87046d7a263f66a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "MQJwqQ==" -> (known after apply)
!~      detect_md5hash      = "CSpCsEfWQC/BixpFSowiww==" -> "different hash"
!~      generation          = 1769567988667864 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "CSpCsEfWQC/BixpFSowiww==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/payments/fct_payments_rides_enghouse.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "iMqWxg==" -> (known after apply)
!~      detect_md5hash      = "vY80UilmgY70A2gYLlJ1+Q==" -> "different hash"
!~      generation          = 1768255231508899 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/payments/fct_payments_rides_enghouse.sql"
!~      md5hash             = "vY80UilmgY70A2gYLlJ1+Q==" -> (known after apply)
        name                = "data/warehouse/models/mart/payments/fct_payments_rides_enghouse.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/payments/enghouse/stg_enghouse__taps.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "dW2mMg==" -> (known after apply)
!~      detect_md5hash      = "IlgiFzqD82eK0trwcFUlgQ==" -> "different hash"
!~      generation          = 1768255231513518 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/payments/enghouse/stg_enghouse__taps.sql"
!~      md5hash             = "IlgiFzqD82eK0trwcFUlgQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/payments/enghouse/stg_enghouse__taps.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "vZPNVg==" -> (known after apply)
!~      detect_md5hash      = "JfYKLwCw/cEbV4T8CjMZYw==" -> "different hash"
!~      generation          = 1769567989880784 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "JfYKLwCw/cEbV4T8CjMZYw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1389](https://github.com/cal-itp/data-infra/actions/runs/21486121395)